import BackPage from "@/components/layout/BackPage";
import Image from "next/image";
import blogImage from "public/slide-4.webp";
import { FaRegClock } from "react-icons/fa6";
import { MdOutlineTimer } from "react-icons/md";

// export default function Page({ params }: { params: { slug: string } }) {
export default function Page() {
  return (
    <main>
      <BackPage title="توصیه‌" link="/" />
      <div className="flex flex-col gap-4">
        {/* image */}
        <div>
          <Image src={blogImage} className="rounded-md" alt="image" />
        </div>
        {/* title */}
        <div className="flex flex-col gap-2">
          <h2 className="text-xl">تأثیر نوآوری‌های دیجیتال بر زندگی مدرن</h2>
          <div className="flex flex-col text-slate-400 text-xs">
            <span className="flex items-center gap-1">
              <span>زمان مورد نیاز برای مطالعه: ۱۰ دقیقه</span>
              <FaRegClock />
            </span>
            <span className="text-end flex items-center gap-1">
              <span>تاریخ انتشار: ۱۴۰۳/۶/۲۱</span>
              <MdOutlineTimer />
            </span>
          </div>
        </div>
        {/* desc */}
        <div className="text-md text-gray-700 text-justify">
          در دنیای امروز، فناوری‌های دیجیتال به سرعت در حال تحول هستند و تأثیرات
          عمیقی بر زندگی روزمره ما گذاشته‌اند. این تأثیرات را می‌توان در
          زمینه‌های مختلفی از جمله ارتباطات، آموزش، بهداشت و حتی تجارت مشاهده
          کرد. بسیاری از کارشناسان معتقدند که نوآوری‌های دیجیتال آینده‌ای متفاوت
          برای جوامع بشری رقم خواهند زد. یکی از مهم‌ترین جنبه‌های نوآوری
          دیجیتال، استفاده از هوش مصنوعی است. هوش مصنوعی به شکل‌های مختلف در
          زندگی روزمره ما نفوذ کرده است، از دستیارهای هوشمند گرفته تا ربات‌هایی
          که وظایف پیچیده‌ای را انجام می‌دهند. این تکنولوژی‌ها نه تنها بهره‌وری
          را افزایش می‌دهند، بلکه فرصت‌های جدیدی را برای کسب‌وکارها فراهم
          می‌کنند. از طرف دیگر، فناوری بلاک‌چین نیز به‌عنوان یکی دیگر از
          نوآوری‌های مهم در دنیای دیجیتال مطرح شده است. این فناوری با ارائه
          زیرساختی امن و شفاف برای انجام معاملات مالی، باعث افزایش اعتماد در
          جوامع مختلف شده است. برخی از شرکت‌های بزرگ دنیا از این فناوری برای
          بهبود امنیت و کارایی در فرآیندهای تجاری خود استفاده می‌کنند. علاوه بر
          این، اینترنت اشیا (IoT) نیز یکی از دیگر از تکنولوژی‌های نوظهور است که
          پتانسیل بالایی برای تغییر زندگی روزمره انسان‌ها دارد. این فناوری با
          اتصال دستگاه‌ها و سیستم‌ها به یکدیگر، امکان کنترل و مدیریت آن‌ها را از
          راه دور فراهم می‌کند. این امکان به کاربران اجازه می‌دهد تا بهره‌وری
          بیشتری داشته باشند و زندگی خود را ساده‌تر کنند. در نهایت، آینده دنیای
          دیجیتال پر از نوآوری‌هایی است که نه تنها زندگی ما را راحت‌تر خواهند
          کرد، بلکه فرصت‌های بیشتری برای رشد و توسعه فردی و اجتماعی فراهم
          می‌کنند. این تحولات، چه در حوزه فناوری‌های نوظهور و چه در زمینه‌هایی
          که هنوز به شکل کامل درک نشده‌اند، نشان‌دهنده مسیر پیش روی ما در دنیای
          دیجیتال هستند.
        </div>
      </div>
    </main>
  );
}
